nxp-mcuxpresso/mcux-soc-svd/KW45Z41082/KW45Z41082.xml
        <register>
          <name>QDCTRL</name>
          <description>Quadrature Decoder Control and Status</description>
          <addressOffset>0x80</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>QUADEN</name>
              <description>QUADEN</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <description>Quadrature decoder mode is disabled.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLE</name>
                  <description>Quadrature decoder mode is enabled.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TOFDIR</name>
              <description>TOFDIR</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>BOTTOM</name>
                  <description>TOF bit was set on the bottom of counting. There was an FTM counter decrement and FTM counter changes from its minimum value (zero) to its maximum value (MOD register).</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TOP</name>
                  <description>TOF bit was set on the top of counting. There was an FTM counter increment and FTM counter changes from its maximum value (MOD register) to its minimum value (zero).</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>QUADIR</name>
              <description>Counter Direction in Quadrature Decode Mode</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DOWN</name>
                  <description>Counter direction is decreasing (counter decrement).</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UP</name>
                  <description>Counter direction is increasing (counter increment).</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>QUADMODE</name>
              <description>Quadrature Decoder Mode</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PHASE</name>
                  <description>Phase encoding mode.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>COUNT_DIR</name>
                  <description>Count and direction encoding mode.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>CONF</name>
          <description>Configuration</description>
          <addressOffset>0x84</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DOZEEN</name>
              <description>Doze Enable</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>COUNT</name>
                  <description>Internal TPM counter continues.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NO_COUNT</name>
                  <description>Internal TPM counter is paused and does not increment. Trigger inputs and input capture events are ignored, and PWM outputs are forced to their default state.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DBGMODE</name>
              <description>Debug Mode</description>
              <bitOffset>6</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NO_COUNT</name>
                  <description>TPM counter is paused and does not increment. Trigger inputs and input capture events are ignored, and PWM outputs are forced to their default state.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>COUNT</name>
                  <description>TPM counter continues.</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>GTBSYNC</name>
              <description>Global Time Base Synchronization</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <description>Global timebase synchronization disabled.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLE</name>
                  <description>Global timebase synchronization enabled.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>GTBEEN</name>
              <description>Global time base enable</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <description>All channels use the internally generated TPM counter as their timebase</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLE</name>
                  <description>All channels use an externally generated global timebase as their timebase</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CSOT</name>
              <description>Counter Start on Trigger</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NO</name>
                  <description>TPM counter starts to increment immediately, once it is enabled.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>YES</name>
                  <description>TPM counter only starts to increment when it a rising edge on the selected input trigger is detected, after it has been enabled or after it has stopped due to overflow.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CSOO</name>
              <description>Counter Stop On Overflow</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NO</name>
                  <description>TPM counter continues incrementing or decrementing after overflow</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>YES</name>
                  <description>TPM counter stops incrementing or decrementing after overflow.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CROT</name>
              <description>Counter Reload On Trigger</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NO</name>
                  <description>Counter is not reloaded due to a rising edge on the selected input trigger</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>YES</name>
                  <description>Counter is reloaded when a rising edge is detected on the selected input trigger</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CPOT</name>
              <description>Counter Pause On Trigger</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NO</name>
                  <description>TPM counter continues</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>YES</name>
                  <description>TPM counter pauses</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TRGPOL</name>
              <description>Trigger Polarity</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>HIGH</name>
                  <description>Trigger is active high.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LOW</name>
                  <description>Trigger is active low.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TRGSRC</name>
              <description>Trigger Source</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>EXTERNAL</name>
                  <description>Trigger source selected by TRGSEL is external.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>INTERNAL</name>
                  <description>Trigger source selected by TRGSEL is internal (channel pin input capture).</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TRGSEL</name>
              <description>Trigger Select</description>
              <bitOffset>24</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CH_0</name>
                  <description>Channel 0 pin input capture</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CH_1</name>
                  <description>Channel 1 pin input capture</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CH_0_1</name>
                  <description>Channel 0 or Channel 1 pin input capture</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
