nxp-mcuxpresso/mcux-soc-svd/KW45Z41082/KW45Z41082.xml
                  <description>Corresponding field of PDOR[PDOn] does not change.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ptco1</name>
                  <description>Corresponding field of PDOR[PDOn] is cleared to logic 0.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PTCO23</name>
              <description>Port Clear Output</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ptco0</name>
                  <description>Corresponding field of PDOR[PDOn] does not change.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ptco1</name>
                  <description>Corresponding field of PDOR[PDOn] is cleared to logic 0.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PTCO24</name>
              <description>Port Clear Output</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ptco0</name>
                  <description>Corresponding field of PDOR[PDOn] does not change.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ptco1</name>
                  <description>Corresponding field of PDOR[PDOn] is cleared to logic 0.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PTCO25</name>
              <description>Port Clear Output</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ptco0</name>
                  <description>Corresponding field of PDOR[PDOn] does not change.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ptco1</name>
                  <description>Corresponding field of PDOR[PDOn] is cleared to logic 0.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PTCO26</name>
              <description>Port Clear Output</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ptco0</name>
                  <description>Corresponding field of PDOR[PDOn] does not change.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ptco1</name>
                  <description>Corresponding field of PDOR[PDOn] is cleared to logic 0.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PTCO27</name>
              <description>Port Clear Output</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ptco0</name>
                  <description>Corresponding field of PDOR[PDOn] does not change.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ptco1</name>
                  <description>Corresponding field of PDOR[PDOn] is cleared to logic 0.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PTCO28</name>
              <description>Port Clear Output</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ptco0</name>
                  <description>Corresponding field of PDOR[PDOn] does not change.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ptco1</name>
                  <description>Corresponding field of PDOR[PDOn] is cleared to logic 0.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PTCO29</name>
              <description>Port Clear Output</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ptco0</name>
                  <description>Corresponding field of PDOR[PDOn] does not change.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ptco1</name>
                  <description>Corresponding field of PDOR[PDOn] is cleared to logic 0.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PTCO30</name>
              <description>Port Clear Output</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ptco0</name>
                  <description>Corresponding field of PDOR[PDOn] does not change.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ptco1</name>
                  <description>Corresponding field of PDOR[PDOn] is cleared to logic 0.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PTCO31</name>
              <description>Port Clear Output</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ptco0</name>
                  <description>Corresponding field of PDOR[PDOn] does not change.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ptco1</name>
                  <description>Corresponding field of PDOR[PDOn] is cleared to logic 0.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
