nxp-mcuxpresso/mcux-soc-svd/KW45Z41082/KW45Z41082.xml
            <field>
              <name>PDD23</name>
              <description>Port Data Direction</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>pdd0</name>
                  <description>Pin is configured as general-purpose input for the GPIO function.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>pdd1</name>
                  <description>Pin is configured as general-purpose output for the GPIO function.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PDD24</name>
              <description>Port Data Direction</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>pdd0</name>
                  <description>Pin is configured as general-purpose input for the GPIO function.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>pdd1</name>
                  <description>Pin is configured as general-purpose output for the GPIO function.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PDD25</name>
              <description>Port Data Direction</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>pdd0</name>
                  <description>Pin is configured as general-purpose input for the GPIO function.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>pdd1</name>
                  <description>Pin is configured as general-purpose output for the GPIO function.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PDD26</name>
              <description>Port Data Direction</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>pdd0</name>
                  <description>Pin is configured as general-purpose input for the GPIO function.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>pdd1</name>
                  <description>Pin is configured as general-purpose output for the GPIO function.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PDD27</name>
              <description>Port Data Direction</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>pdd0</name>
                  <description>Pin is configured as general-purpose input for the GPIO function.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>pdd1</name>
                  <description>Pin is configured as general-purpose output for the GPIO function.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PDD28</name>
              <description>Port Data Direction</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>pdd0</name>
                  <description>Pin is configured as general-purpose input for the GPIO function.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>pdd1</name>
                  <description>Pin is configured as general-purpose output for the GPIO function.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PDD29</name>
              <description>Port Data Direction</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>pdd0</name>
                  <description>Pin is configured as general-purpose input for the GPIO function.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>pdd1</name>
                  <description>Pin is configured as general-purpose output for the GPIO function.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PDD30</name>
              <description>Port Data Direction</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>pdd0</name>
                  <description>Pin is configured as general-purpose input for the GPIO function.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>pdd1</name>
                  <description>Pin is configured as general-purpose output for the GPIO function.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PDD31</name>
              <description>Port Data Direction</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>pdd0</name>
                  <description>Pin is configured as general-purpose input for the GPIO function.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>pdd1</name>
                  <description>Pin is configured as general-purpose output for the GPIO function.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
